driver-tests/bpelse/assign/AssignJbi/test/echoIntegerDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoIntegerDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoIntegerDataType">
    <string>100</string>
    <normalizedString>100</normalizedString>
    <token>100</token>
    <base64Binary>100</base64Binary>
    <hexBinary>100</hexBinary>
    <integer>100</integer>
    <positiveInteger>100</positiveInteger>
    <negativeInteger>100</negativeInteger>
    <nonNegativeInteger>100</nonNegativeInteger>
    <nonPositiveInteger>100</nonPositiveInteger>
    <long>100</long>
    <unsignedLong>100</unsignedLong>
    <int>100</int>
    <unsignedInt>100</unsignedInt>
    <short>100</short>
    <unsignedShort>100</unsignedShort>
    <byte>100</byte>
    <unsignedByte>100</unsignedByte>
    <decimal>100</decimal>
    <float>100</float>
    <double>100</double>
    <boolean>100</boolean>
    <duration>100</duration>
    <dateTime>100</dateTime>
    <date>100</date>
    <time>100</time>
    <gYear>100</gYear>
    <gYearMonth>100</gYearMonth>
    <gMonth>100</gMonth>
    <gMonthDay>100</gMonthDay>
    <gDay>100</gDay>
    <Name>100</Name>
    <QName>100</QName>
    <NCName>100</NCName>
    <anyURI>100</anyURI>
    <language>100</language>
    <ID>100</ID>
    <IDREF>100</IDREF>
    <IDREFS>100</IDREFS>
    <ENTITY>100</ENTITY>
    <ENTITIES>100</ENTITIES>
    <NMTOKEN>100</NMTOKEN>
    <NMTOKENS>100</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
